Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/include/component/can.h
#define CAN_DBTP_DSJW_Pos                     _U_(0)                                               /**< (CAN_DBTP) Data (Re)Synchronization Jump Width Position */
#define CAN_DBTP_DSJW_Msk                     (_U_(0xF) << CAN_DBTP_DSJW_Pos)                      /**< (CAN_DBTP) Data (Re)Synchronization Jump Width Mask */
#define CAN_DBTP_DSJW(value)                  (CAN_DBTP_DSJW_Msk & ((value) << CAN_DBTP_DSJW_Pos))
#define CAN_DBTP_DTSEG2_Pos                   _U_(4)                                               /**< (CAN_DBTP) Data time segment after sample point Position */
#define CAN_DBTP_DTSEG2_Msk                   (_U_(0xF) << CAN_DBTP_DTSEG2_Pos)                    /**< (CAN_DBTP) Data time segment after sample point Mask */
#define CAN_DBTP_DTSEG2(value)                (CAN_DBTP_DTSEG2_Msk & ((value) << CAN_DBTP_DTSEG2_Pos))
#define CAN_DBTP_DTSEG1_Pos                   _U_(8)                                               /**< (CAN_DBTP) Data time segment before sample point Position */
#define CAN_DBTP_DTSEG1_Msk                   (_U_(0x1F) << CAN_DBTP_DTSEG1_Pos)                   /**< (CAN_DBTP) Data time segment before sample point Mask */
#define CAN_DBTP_DTSEG1(value)                (CAN_DBTP_DTSEG1_Msk & ((value) << CAN_DBTP_DTSEG1_Pos))
#define CAN_DBTP_DBRP_Pos                     _U_(16)                                              /**< (CAN_DBTP) Data Baud Rate Prescaler Position */
#define CAN_DBTP_DBRP_Msk                     (_U_(0x1F) << CAN_DBTP_DBRP_Pos)                     /**< (CAN_DBTP) Data Baud Rate Prescaler Mask */
#define CAN_DBTP_DBRP(value)                  (CAN_DBTP_DBRP_Msk & ((value) << CAN_DBTP_DBRP_Pos))
#define CAN_DBTP_TDC_Pos                      _U_(23)                                              /**< (CAN_DBTP) Tranceiver Delay Compensation Position */
#define CAN_DBTP_TDC_Msk                      (_U_(0x1) << CAN_DBTP_TDC_Pos)                       /**< (CAN_DBTP) Tranceiver Delay Compensation Mask */
#define CAN_DBTP_TDC(value)                   (CAN_DBTP_TDC_Msk & ((value) << CAN_DBTP_TDC_Pos))  
#define CAN_DBTP_Msk                          _U_(0x009F1FFF)                                      /**< (CAN_DBTP) Register Mask  */


/* -------- CAN_TEST : (CAN Offset: 0x10) (R/W 32) Test -------- */
#define CAN_TEST_RESETVALUE                   _U_(0x00)                                            /**<  (CAN_TEST) Test  Reset Value */

#define CAN_TEST_LBCK_Pos                     _U_(4)                                               /**< (CAN_TEST) Loop Back Mode Position */
#define CAN_TEST_LBCK_Msk                     (_U_(0x1) << CAN_TEST_LBCK_Pos)                      /**< (CAN_TEST) Loop Back Mode Mask */
#define CAN_TEST_LBCK(value)                  (CAN_TEST_LBCK_Msk & ((value) << CAN_TEST_LBCK_Pos))
#define CAN_TEST_TX_Pos                       _U_(5)                                               /**< (CAN_TEST) Control of Transmit Pin Position */
#define CAN_TEST_TX_Msk                       (_U_(0x3) << CAN_TEST_TX_Pos)                        /**< (CAN_TEST) Control of Transmit Pin Mask */
#define CAN_TEST_TX(value)                    (CAN_TEST_TX_Msk & ((value) << CAN_TEST_TX_Pos))    
#define   CAN_TEST_TX_CORE_Val                _U_(0x0)                                             /**< (CAN_TEST) TX controlled by CAN core  */
#define   CAN_TEST_TX_SAMPLE_Val              _U_(0x1)                                             /**< (CAN_TEST) TX monitoring sample point  */
#define   CAN_TEST_TX_DOMINANT_Val            _U_(0x2)                                             /**< (CAN_TEST) Dominant (0) level at pin CAN_TX  */
#define   CAN_TEST_TX_RECESSIVE_Val           _U_(0x3)                                             /**< (CAN_TEST) Recessive (1) level at pin CAN_TX  */
#define CAN_TEST_TX_CORE                      (CAN_TEST_TX_CORE_Val << CAN_TEST_TX_Pos)            /**< (CAN_TEST) TX controlled by CAN core Position  */
#define CAN_TEST_TX_SAMPLE                    (CAN_TEST_TX_SAMPLE_Val << CAN_TEST_TX_Pos)          /**< (CAN_TEST) TX monitoring sample point Position  */
#define CAN_TEST_TX_DOMINANT                  (CAN_TEST_TX_DOMINANT_Val << CAN_TEST_TX_Pos)        /**< (CAN_TEST) Dominant (0) level at pin CAN_TX Position  */
#define CAN_TEST_TX_RECESSIVE                 (CAN_TEST_TX_RECESSIVE_Val << CAN_TEST_TX_Pos)       /**< (CAN_TEST) Recessive (1) level at pin CAN_TX Position  */
#define CAN_TEST_RX_Pos                       _U_(7)                                               /**< (CAN_TEST) Receive Pin Position */
#define CAN_TEST_RX_Msk                       (_U_(0x1) << CAN_TEST_RX_Pos)                        /**< (CAN_TEST) Receive Pin Mask */
#define CAN_TEST_RX(value)                    (CAN_TEST_RX_Msk & ((value) << CAN_TEST_RX_Pos))    
#define CAN_TEST_Msk                          _U_(0x000000F0)                                      /**< (CAN_TEST) Register Mask  */


/* -------- CAN_RWD : (CAN Offset: 0x14) (R/W 32) RAM Watchdog -------- */
#define CAN_RWD_RESETVALUE                    _U_(0x00)                                            /**<  (CAN_RWD) RAM Watchdog  Reset Value */

#define CAN_RWD_WDC_Pos                       _U_(0)                                               /**< (CAN_RWD) Watchdog Configuration Position */
#define CAN_RWD_WDC_Msk                       (_U_(0xFF) << CAN_RWD_WDC_Pos)                       /**< (CAN_RWD) Watchdog Configuration Mask */
#define CAN_RWD_WDC(value)                    (CAN_RWD_WDC_Msk & ((value) << CAN_RWD_WDC_Pos))    
#define CAN_RWD_WDV_Pos                       _U_(8)                                               /**< (CAN_RWD) Watchdog Value Position */
#define CAN_RWD_WDV_Msk                       (_U_(0xFF) << CAN_RWD_WDV_Pos)                       /**< (CAN_RWD) Watchdog Value Mask */
#define CAN_RWD_WDV(value)                    (CAN_RWD_WDV_Msk & ((value) << CAN_RWD_WDV_Pos))    
#define CAN_RWD_Msk                           _U_(0x0000FFFF)                                      /**< (CAN_RWD) Register Mask  */


/* -------- CAN_CCCR : (CAN Offset: 0x18) (R/W 32) CC Control -------- */
#define CAN_CCCR_RESETVALUE                   _U_(0x01)                                            /**<  (CAN_CCCR) CC Control  Reset Value */

#define CAN_CCCR_INIT_Pos                     _U_(0)                                               /**< (CAN_CCCR) Initialization Position */
#define CAN_CCCR_INIT_Msk                     (_U_(0x1) << CAN_CCCR_INIT_Pos)                      /**< (CAN_CCCR) Initialization Mask */
#define CAN_CCCR_INIT(value)                  (CAN_CCCR_INIT_Msk & ((value) << CAN_CCCR_INIT_Pos))
#define CAN_CCCR_CCE_Pos                      _U_(1)                                               /**< (CAN_CCCR) Configuration Change Enable Position */
#define CAN_CCCR_CCE_Msk                      (_U_(0x1) << CAN_CCCR_CCE_Pos)                       /**< (CAN_CCCR) Configuration Change Enable Mask */
#define CAN_CCCR_CCE(value)                   (CAN_CCCR_CCE_Msk & ((value) << CAN_CCCR_CCE_Pos))  
#define CAN_CCCR_ASM_Pos                      _U_(2)                                               /**< (CAN_CCCR) ASM Restricted Operation Mode Position */
#define CAN_CCCR_ASM_Msk                      (_U_(0x1) << CAN_CCCR_ASM_Pos)                       /**< (CAN_CCCR) ASM Restricted Operation Mode Mask */
#define CAN_CCCR_ASM(value)                   (CAN_CCCR_ASM_Msk & ((value) << CAN_CCCR_ASM_Pos))  
#define CAN_CCCR_CSA_Pos                      _U_(3)                                               /**< (CAN_CCCR) Clock Stop Acknowledge Position */
#define CAN_CCCR_CSA_Msk                      (_U_(0x1) << CAN_CCCR_CSA_Pos)                       /**< (CAN_CCCR) Clock Stop Acknowledge Mask */
#define CAN_CCCR_CSA(value)                   (CAN_CCCR_CSA_Msk & ((value) << CAN_CCCR_CSA_Pos))  
#define CAN_CCCR_CSR_Pos                      _U_(4)                                               /**< (CAN_CCCR) Clock Stop Request Position */
#define CAN_CCCR_CSR_Msk                      (_U_(0x1) << CAN_CCCR_CSR_Pos)                       /**< (CAN_CCCR) Clock Stop Request Mask */
#define CAN_CCCR_CSR(value)                   (CAN_CCCR_CSR_Msk & ((value) << CAN_CCCR_CSR_Pos))  
#define CAN_CCCR_MON_Pos                      _U_(5)                                               /**< (CAN_CCCR) Bus Monitoring Mode Position */
#define CAN_CCCR_MON_Msk                      (_U_(0x1) << CAN_CCCR_MON_Pos)                       /**< (CAN_CCCR) Bus Monitoring Mode Mask */
#define CAN_CCCR_MON(value)                   (CAN_CCCR_MON_Msk & ((value) << CAN_CCCR_MON_Pos))  
#define CAN_CCCR_DAR_Pos                      _U_(6)                                               /**< (CAN_CCCR) Disable Automatic Retransmission Position */
#define CAN_CCCR_DAR_Msk                      (_U_(0x1) << CAN_CCCR_DAR_Pos)                       /**< (CAN_CCCR) Disable Automatic Retransmission Mask */
#define CAN_CCCR_DAR(value)                   (CAN_CCCR_DAR_Msk & ((value) << CAN_CCCR_DAR_Pos))  
#define CAN_CCCR_TEST_Pos                     _U_(7)                                               /**< (CAN_CCCR) Test Mode Enable Position */
#define CAN_CCCR_TEST_Msk                     (_U_(0x1) << CAN_CCCR_TEST_Pos)                      /**< (CAN_CCCR) Test Mode Enable Mask */
#define CAN_CCCR_TEST(value)                  (CAN_CCCR_TEST_Msk & ((value) << CAN_CCCR_TEST_Pos))
#define CAN_CCCR_FDOE_Pos                     _U_(8)                                               /**< (CAN_CCCR) FD Operation Enable Position */
#define CAN_CCCR_FDOE_Msk                     (_U_(0x1) << CAN_CCCR_FDOE_Pos)                      /**< (CAN_CCCR) FD Operation Enable Mask */
#define CAN_CCCR_FDOE(value)                  (CAN_CCCR_FDOE_Msk & ((value) << CAN_CCCR_FDOE_Pos))
#define CAN_CCCR_BRSE_Pos                     _U_(9)                                               /**< (CAN_CCCR) Bit Rate Switch Enable Position */
#define CAN_CCCR_BRSE_Msk                     (_U_(0x1) << CAN_CCCR_BRSE_Pos)                      /**< (CAN_CCCR) Bit Rate Switch Enable Mask */
#define CAN_CCCR_BRSE(value)                  (CAN_CCCR_BRSE_Msk & ((value) << CAN_CCCR_BRSE_Pos))
#define CAN_CCCR_PXHD_Pos                     _U_(12)                                              /**< (CAN_CCCR) Protocol Exception Handling Disable Position */
#define CAN_CCCR_PXHD_Msk                     (_U_(0x1) << CAN_CCCR_PXHD_Pos)                      /**< (CAN_CCCR) Protocol Exception Handling Disable Mask */
#define CAN_CCCR_PXHD(value)                  (CAN_CCCR_PXHD_Msk & ((value) << CAN_CCCR_PXHD_Pos))
#define CAN_CCCR_EFBI_Pos                     _U_(13)                                              /**< (CAN_CCCR) Edge Filtering during Bus Integration Position */
#define CAN_CCCR_EFBI_Msk                     (_U_(0x1) << CAN_CCCR_EFBI_Pos)                      /**< (CAN_CCCR) Edge Filtering during Bus Integration Mask */
#define CAN_CCCR_EFBI(value)                  (CAN_CCCR_EFBI_Msk & ((value) << CAN_CCCR_EFBI_Pos))
#define CAN_CCCR_TXP_Pos                      _U_(14)                                              /**< (CAN_CCCR) Transmit Pause Position */
#define CAN_CCCR_TXP_Msk                      (_U_(0x1) << CAN_CCCR_TXP_Pos)                       /**< (CAN_CCCR) Transmit Pause Mask */
#define CAN_CCCR_TXP(value)                   (CAN_CCCR_TXP_Msk & ((value) << CAN_CCCR_TXP_Pos))  
#define CAN_CCCR_Msk                          _U_(0x000073FF)                                      /**< (CAN_CCCR) Register Mask  */


/* -------- CAN_NBTP : (CAN Offset: 0x1C) (R/W 32) Nominal Bit Timing and Prescaler -------- */
#define CAN_NBTP_RESETVALUE                   _U_(0x6000A03)                                       /**<  (CAN_NBTP) Nominal Bit Timing and Prescaler  Reset Value */

#define CAN_NBTP_NTSEG2_Pos                   _U_(0)                                               /**< (CAN_NBTP) Nominal Time segment after sample point Position */
#define CAN_NBTP_NTSEG2_Msk                   (_U_(0x7F) << CAN_NBTP_NTSEG2_Pos)                   /**< (CAN_NBTP) Nominal Time segment after sample point Mask */
#define CAN_NBTP_NTSEG2(value)                (CAN_NBTP_NTSEG2_Msk & ((value) << CAN_NBTP_NTSEG2_Pos))
#define CAN_NBTP_NTSEG1_Pos                   _U_(8)                                               /**< (CAN_NBTP) Nominal Time segment before sample point Position */
#define CAN_NBTP_NTSEG1_Msk                   (_U_(0xFF) << CAN_NBTP_NTSEG1_Pos)                   /**< (CAN_NBTP) Nominal Time segment before sample point Mask */
#define CAN_NBTP_NTSEG1(value)                (CAN_NBTP_NTSEG1_Msk & ((value) << CAN_NBTP_NTSEG1_Pos))
#define CAN_NBTP_NBRP_Pos                     _U_(16)                                              /**< (CAN_NBTP) Nominal Baud Rate Prescaler Position */
#define CAN_NBTP_NBRP_Msk                     (_U_(0x1FF) << CAN_NBTP_NBRP_Pos)                    /**< (CAN_NBTP) Nominal Baud Rate Prescaler Mask */
#define CAN_NBTP_NBRP(value)                  (CAN_NBTP_NBRP_Msk & ((value) << CAN_NBTP_NBRP_Pos))
#define CAN_NBTP_NSJW_Pos                     _U_(25)                                              /**< (CAN_NBTP) Nominal (Re)Synchronization Jump Width Position */
#define CAN_NBTP_NSJW_Msk                     (_U_(0x7F) << CAN_NBTP_NSJW_Pos)                     /**< (CAN_NBTP) Nominal (Re)Synchronization Jump Width Mask */
#define CAN_NBTP_NSJW(value)                  (CAN_NBTP_NSJW_Msk & ((value) << CAN_NBTP_NSJW_Pos))
#define CAN_NBTP_Msk                          _U_(0xFFFFFF7F)                                      /**< (CAN_NBTP) Register Mask  */


